* 1.1 Язык - среда, в которой мы организуем свое мышление о процессах.
  Всякий язык программирования обладает тремя предназначенными для этого механизмами:
  1. элементарные выражения, представляющие минимальные сущности, с которыми язык имеет дело;
  2. средства комбинирования, с помощью которых из простых объектов составляются сложные;
  3. средства абстракции, с помощью которых сложные объекты можно называть и обращаться с ними как с единым целым.

* 1.1.1 Выражения
  Если Вы дадите Лиспу число 486 интерпретатор ответит Вам, напечатав 486
	Выражения, представляющие числа, могут сочетаться с выражением, представляющим элементарную процедуру (скажем, + или *)
#+begin_src elisp
	(+ 137 349)
#+end_src

#+RESULTS:
: 486

 + оператор 137 349 операнды 

   Соглашение, по которому оператор ставится слева от операндов, известно как префиксная нотация (prefix notation)
	
   У префиксной нотации есть преимущества.
	1) Префиксная запись может распространяться на процедуры с произвольным количеством аргументов
	2) Онаа естественным образом расширяется, позволяя комбинациям вкладываться (nest) друг в друга, то есть допускает комбинации, элементы которых сами являются комбинациями:
	Мы можем облегчить себе задачу, записывая длинные выражения в форме
#+begin_src elisp
(+ (* 3
      (+ (* 2 4)
         (+ 3 5)))
   (+ (- 10 7)
6))
#+end_src

#+RESULTS:
: 57
  Эти правила форматирования называются красивая печать (pretty printing).
     
  
